# Built In Failures Numbering Failures Number Already In Use Error Property

Source: https://www.revitapidocs.com/2026/0dfd552a-b07e-ed5d-62be-a349b7268a4b.htm

---

| Built In Failures Numbering Failures Number Already In Use Error Property |
| --- |

The new number is already in use.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId NumberAlreadyInUseError { get; }
```

```
Public Shared ReadOnly Property NumberAlreadyInUseError As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ NumberAlreadyInUseError {
	FailureDefinitionId^ get ();
}
```

```
static member NumberAlreadyInUseError : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures NumberingFailures Class Autodesk.Revit.DB Namespace